{

	"blogs": [
				{
					"title": "Week 1 Learnings/Review",
					"post": "Started creating repositories from directories on my local system. Began working with git locally and on Github. Created the foundation of my github profile by making and committing files. Learned to push repositories to github while learning basic terminal commands.",
					"footer": "Pete"

				},

				{
					"title": "Week 2 Learnings",
					"post": "Delved deeper into git commands and javascript.  Started team projects and learned the basics of working with a group to cooperatively create a website.  Learned the keyframe rotate CSS animation and how to synchronize an input range with a number value. Started writing functions with javascript, including for loops, forEach, switch statements. How to link a function to create contents of the html by equating it all to a variable that writes to the document. Started working with pull requests and merging to the master of github and local master.",
					"footer": "Pete"
				},

				{
					"title": "Week 3 Learnings",
					"post": "Week 3 introduced several new concepts as well as solidified previous elements that I have been working with. I began to work with event listeners more in depth. I was taught the fundamentals of Sass and what it is used for and that it entails creating a mirror-type css sheet for your projects. I learned about Bootstrap and Materialize, two frameworks that are commonly used in styling amongst developers.  I learned more about javascript in properly creating functions and I improved my understanding of these elements. I was also introduced to array method chaining in single page applications.",
					"footer": "Pete"
				},

				{
					"title": "Week 4 Learnings",
					"post": "This week I began to learn the fundamentals of single page applications.  We were introduced to advanced functions, array functions, event listeners, XHR's, and IIFE's.  We completed a group project creating a simple translation platform for multiple languages.  I learned more about the way functions work and more advanced properties of arrays, event listeners, and objects.  The basics are now being utilized at a more advanced level and my coding is becoming complex.",
					"footer": "Pete"
				},

				{
					"title": "Week 5 Learnings",
					"post": "Final week in the single page application milestone. This week was the most difficult for me so far. I feel like I am behind in learning about IIFE's and object augmentation.  I learned more about XHR requests and how to create projects (like Seasonal Sales) that modified item prices according to certain attributes or id's. I worked with string manipulation and advanced array methods.  I also completed projects that included function callbacks and parsing data from JSON files.  My learning has continued to grow in all aspects of coding. I need to study more about IIFEs, augmentation, and how to use Sass. I am concerned about my comprehension of these subjects.",
					"footer": "Pete"
				}
			]

}